{"pages":[],"posts":[{"title":"Sitecore wish list","permalink":"http://sitecoresource.com/2019/04/09/sitecore-wish-list/","text":"This post is dedicated to a wishlist of what we would like to see from features to documentation and everything in between.Please feel free to comment below or email me on &#114;&#100;&#x69;&#97;&#x73;&#x40;&#49;&#x64;&#x69;&#x67;&#105;&#116;&#x2e;&#99;&#111;&#x2e;&#x75;&#107; if you want me to add something to this list, correct me or let me know if a wish has been granted. FeaturesWorkflow &amp; WorkboxI’ve been working with Sitecore since version 5.3 and I must say that the workbox seems to have hardly changed.We are selling Sitecore to clients with thousands of content items, globally distributed authoring teams and this content is often constantly changing. The current workbox isn’t suitable for large volumes of content and authors are often requesting to bypass the Sitecore workflow altogether which is a very bad thing.Start thinking about: Redoing the UI to make approving large numbers of content realistic Better methods of grouping content and assiging to individual approvers Using the search index to power the new workflow UI SXA is out, we can start approving partial designs/ composites etc as a whole Media cropping OTBPersonalisation with CDNAt the moment Sitecore does all of its personalisation on the client side unless you start using some JSS functionality.If you’re a client with a global presense (and there are a lot of these) who needs to cover more than one geographical region and don’t want to spend large sums on a geographically distributed CD node system then you will most likely be using a CDN like Akamai, Cloudlare or any number of players.If we want to make use of Sitecores’ rich personalisation and analytics we won’t be able to edge cache the actual documents (Media or any other assets are not an issue). If we edge cache the document then the persona profiling won’t work nor will other personalisation functionality.Sitecore needs to move personalisation and content profiling to the client side so that working with CDN’s won’t hinder any Sitecore functionality. DevelopmentAsync Sitecore ControllersPlease please can we have async controllers? the ability to mark renderings as async would be fantastic, this means non-essential renderings can be loaded asynctonously without our pages needing to ‘wait’ for them. The sooner the server can respond with the DOM the better.1public async Task&lt;ActionResult&gt; MarketingTile() Here is a nice article about how async methods work in ASP.NET. DocumentationBetter scaling guidelines ExamplesWhat can Sitecore provide in terms of examples, tutorials and demo enviornments? Helix &amp; HabitatThis was going to be about providing better Helix project examples than Habitat. Luckily, this is going to happen already as announced by Peter Brinkman at Sugcon London 2019.There will be 3 new demo environments released (with source code) for small, medium and enterprise scale Sitecore Helix solutions!"}]}